lines_numb=input("Введите количество строк: ") # запрашивает количество строк
if lines_numb.isdigit() and int(lines_numb) > 0: #проверка введенного значения
    lines_numb = int(lines_numb) #Если условия верны значение присваивается переменной
else: #элсе :)
    print("Введено некорректное число, значение устанавливается по умолчанию(1)") # если условие не верно
    lines_numb = 1 # переменной присваивается значение 1
lines = [] # создание массива 
for i in range(lines_numb): # цикл for 
    line = input(f"Введите строку {i + 1}: ") # запрашивает строку 
    lines.append(line) # добавляет линии в созданный массив
text = ' '.join(lines) # объединение списка в строку с помощью пробела
words = text.split() # разделение строки по пробелу на слова
words = set(words) # создание множества не повторяющихся слов
count = len(words) # подсчет количества слов
print(f"\nКоличество различных слов в тексте: ", count) # вывод